In [ ]:
import math
import numpy as np
import pandas as pd
import re

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
import os


GOOGLE_DRIVE_PATH_AFTER_MYDRIVE = 'CS839_project'
GOOGLE_DRIVE_PATH = os.path.join('drive', 'My Drive', GOOGLE_DRIVE_PATH_AFTER_MYDRIVE)
print(os.listdir(GOOGLE_DRIVE_PATH))

['anmol_predictions', 'schema_linking.ipynb', 'Dataset']

In [ ]:
import json

schema_path = os.path.join(GOOGLE_DRIVE_PATH,'Dataset/tables.json')
# data_path = os.path.join(GOOGLE_DRIVE_PATH,'Dataset/train_spider.json')

def get_entities(schema_path):
    with open(table_path, 'r', encoding='utf8') as f:
        table_datas = json.load(f)

    output_tab = {}
    tables = {}
    tabel_name = set()
    for i in range(len(table_datas)):
        table = table_datas[i]
        temp = {}
        temp['col_map'] = table['column_names']
        temp['table_names'] = table['table_names']
        tmp_col = []
        for cc in [x[1] for x in table['column_names_original']]:
            if cc not in tmp_col:
                tmp_col.append(cc)
        table['col_set'] = tmp_col
        db_name = table['db_id']
        tabel_name.add(db_name)
        table['schema_content'] = [col[1] for col in table['column_names']]
        table['col_table'] = [col[0] for col in table['column_names']]
        output_tab[db_name] = temp
        tables[db_name] = table

    return tables

db_dict = get_entities(table_path)

# Use 'col_set' from db_dict[<db_id>'] to match column names
# Use 'table_names' from db_dict[<db_id>] to match table names

In [ ]:
# db_id = 'car_1'
# db_dict[db_id]['col_set']
# db_dict[db_id]['table_names']

In [ ]:
import difflib

def get_matches(entity_lst, known_lst):
  match_dict = {}
  for entity in entity_lst:
    match_1 = difflib.get_close_matches(entity, known_lst, n=1, cutoff=0.3)
    if match_1 != []:
      match_dict[entity] = match_1[0]
    else:
      entity_lst.remove(entity)
  return entity_lst, match_dict

def replace_entity(pred, entity_lst, match_dict):
  for entity in entity_lst:
    pred = pred.replace(entity, match_dict[entity])
  return pred

In [ ]:
# pred = 'SELECT count(*) FROM airlines as from abc join from xyz'.lower()
# pred = 'SELECT count(number), sum(abc), T.ncv, A1.xyz, grade FROM High_School AS T1'.lower()

In [ ]:
# Table correction
def correct_tables(db_dict, db_id, pred):
  out = re.findall(r'from (.*?) (as|join|$)', pred)
  tables = [match[0] for match in out]

  out = re.findall(r'join (.*?) (where|groupby|having|$)', pred)
  table_2 =  [match[0] for match in out]
  tables = tables + table_2

  tables, match_dict = get_matches(tables, db_dict[db_id]['table_names_original'])
  pred = replace_entity(pred, tables, match_dict)

  return pred

# Column correction
def correct_columns(db_dict, db_id, pred):
  columns = re.findall(r'select (.*?) from', pred)
  if columns != []:
    columns = columns[0]
    columns = columns.split(',')

    agg_fn_lst = ['count','sum','avg','min','max']
    for agg_fn in agg_fn_lst:
      columns = [term.replace(agg_fn+'(','') for term in columns]
      columns = [term.replace(')','') for term in columns]

    columns = [re.sub(r'.*\.', '', term) for term in columns]

    columns = [term.strip() for term in columns]
    if '*' in columns:
      columns.remove('*')
    # print(columns)
    columns, match_dict = get_matches(columns, db_dict[db_id]['col_set'])
    # print(columns)
    pred = replace_entity(pred, columns, match_dict)

  return pred

In [ ]:
row = results.iloc[812]
print(i)
db_id = row['DB']
gold = row['Gold']
pred = row['Pred'].lower()
print(db_id)
print(pred)
pred = correct_tables(db_dict, db_id, pred)
pred = correct_columns(db_dict, db_id, pred)
print(pred)

812
world_1
select name, year_of_independence, surface_area from
select name, LifeExpectancy, SurfaceArea from

In [ ]:
results = pd.read_csv(os.path.join(GOOGLE_DRIVE_PATH,'anmol_predictions/Results.csv'))
row = results.iloc[0]
i = 0
preds_ec = []
for idx, row in results.iterrows():
  print(i)
  db_id = row['DB']
  gold = row['Gold']
  pred = row['Pred'].lower()
  print(db_id)
  print(pred)
  try:
    pred = correct_tables(db_dict, db_id, pred)
    pred = correct_columns(db_dict, db_id, pred)
  except:
    pass
  print(pred)
  preds_ec.append(pred)
  # if i==10:
  #   break
  i+=1

0
network_1
select t1.name, count(*) from high_schoolers as t
select t1.name, count(*) from Highschooler as t
1
cre_Doc_Template_Mgt
select template_type_code from templates group by template_type_
select Template_Type_Code from templates group by template_type_
2
dog_kennels
select breed_name from dogs order by count(*) desc li
select breed_name from dogs order by count(*) desc li
3
dog_kennels
select charge_amount from charges order by charge_amount desc
select charge_amount from charges order by charge_amount desc
4
employee_hire_evaluation
select count(*), name from shop</s>
select count(*), Name from shop</s>
5
flight_2
select count(*) from airlines where country = "usa"</s>
select count(*) from airlines where country = "usa"</s>
6
dog_kennels
select owner_id, last_name from treatments where spending_
select owner_id, last_name from treatments where spending_
7
network_1
select t1.name from likes as t1 join student as t2
select t1.name from Likes as t1 join student as t2
8
singer
select t2.name, t2.revenue from singer as t1 jo
select t2.Name, t2.revenue from singer as t1 jo
9
car_1
select model from models order by count(*) desc limit 1
select Model from Models order by count(*) desc limit 1
10
student_transcripts_tracking
select zip_postcode from addresses where city = "port chelsea"</s>
select zip_postcode from addresses where city = "port chelsea"</s>
11
singer
select t1.name from singer as t1 join song as t2 on
select t1.Name from singer as t1 join song as t2 on
12
world_1
select count(distinct government_form) from country where capital =
select count(GovernmentForm) from country where capital =
13
employee_hire_evaluation
select district from shop where store_id not in (select store
select District from shop where store_id not in (select store
14
dog_kennels
select count(*) from dogs where owner_id not in (
select count(*) from dogs where owner_id not in (
15
dog_kennels
select count(*) from dogs where age <unk>(select
select count(*) from dogs where age <unk>(select
16
course_teach
select t1.age, t1.city from teacher as t1 join
select t1.Age, t1.city from teacher as t1 join
17
student_transcripts_tracking
select first_name, middle_name, last_name from students w
select first_name, middle_name, last_name from students w
18
tvshow
select produdction_code, channel from cartoon group by
select Production_code, Channel from cartoon group by
19
concert_singer
select name, capacity from concert where year = 2014 or year = 2014
select Name, Capacity from concert where year = 2014 or year = 2014
20
flight_2
select count(*) from flights where country = "united airlines
select count(*) from flights where country = "united airlines
21
world_1
select count(*) from country where language = 'english'
select count(*) from country where language = 'english'
22
employee_hire_evaluation
select manager_name, district from shop order by count(*)
select Manager_name, District from shop order by count(*)
23
cre_Doc_Template_Mgt
select template_type_code from templates group by template_type_
select Template_Type_Code from templates group by template_type_
24
employee_hire_evaluation
select manager_name, district from shop order by count(*)
select Manager_name, District from shop order by count(*)
25
dog_kennels
select professional_id, cell_number from treatments group b
select professional_id, cell_number from treatments group b
26
flight_2
select count(*) from flights where city = 'aberde
select count(*) from flights where city = 'aberde
27
tvshow
select title from cartoon order by title</s>
select Title from cartoon order by Title</s>
28
dog_kennels
select first_name, last_name from dogs</s>
select first_name, last_name from dogs</s>
29
concert_singer
select name from singer where age > (select avg(
select Name from singer where age > (select avg(
30
network_1
select t1.name from high_schoolers as t1 join likes
select t1.name from Highschooler as t1 join likes
31
wta_1
select t1.first_name, t1.last_name from matches as t
select t1.first_name, t1.last_name from matches as t
32
cre_Doc_Template_Mgt
select count(*) from documents where document_name like "
select count(*) from documents where document_name like "
33
wta_1
select sum(ranking_points), t1.first_name from
select sum(ranking_points), t1.first_name from
34
world_1
select country_code from country where population <unk>(select country_
select CountryCode from country where population <unk>(select country_
35
orchestra
select t1.name from conductor as t1 join orchestra as t2
select t1.Name from conductor as t1 join orchestra as t2
36
dog_kennels
select cost_of_treatment, treatment_type_description from treatments
select cost_of_treatment, treatment_type_description from treatments
37
concert_singer
select name from concert where stadium_id not in (select stadium
select Name from concert where stadium_id not in (select stadium
38
pets_1
select avg(age), max(age) from pets</s>
select avg(Age), max(Age) from pets</s>
39
car_1
select year from cars where weight <unk>4000 and year > 3000
select Year from cars where weight <unk>4000 and Year > 3000
40
wta_1
select avg(t1.winner_rank) from matches as t
select avg(t1.winner_rank) from matches as t
41
wta_1
select count(*) from matches where year = 2013 or year = 2016
select count(*) from matches where year = 2013 or year = 2016
42
employee_hire_evaluation
select count(distinct store_location) from hiring</s>
select count(Location) from hiring</s>
43
network_1
select count(*) from likes where friend = 'know
select count(*) from likes where friend = 'know
44
singer
select distinct name from singer where net worth_millions
select Highest_Position from singer where net worth_millions
45
student_transcripts_tracking
select phone_number from addresses where first_name = "tim
select cell_mobile_number from addresses where first_name = "tim
46
car_1
select count(*) from car_makers where continent = "
select count(*) from car_makers where continent = "
47
concert_singer
select country, count(*) from singer</s>
select Country, count(*) from singer</s>
48
dog_kennels
select owner_id, last_name from treatments where dog_
select owner_id, last_name from treatments where dog_
49
network_1
select avg(grade) from student where student_id
select avg(grade) from student where student_id
50
wta_1
select t1.first_name, t1.last_name, t1.
select t1.first_name, t1.last_name, t1.
51
network_1
select t1.name from student as t1 join student as t2 on
select t1.name from Friend as t1 join Friend as t2 on
52
car_1
select count(*) from cars where accelerate = "accrob
select count(*) from cars where accelerate = "accrob
53
employee_hire_evaluation
select count(*), location from shop</s>
select count(*), Location from shop</s>
54
cre_Doc_Template_Mgt
select document_id, document_name, document_description from document
select Document_ID, Document_Name, Document_Description from document
55
course_teach
select t1.name, t1.course from course as t1 join
select t1.Name, t1.Course from Course as t1 join
56
cre_Doc_Template_Mgt
select count(distinct document_name) from documents where document
select count(Document_Name) from documents where document
57
tvshow
select country from cartoon where written_by = "tadolph case
select Country from cartoon where written_by = "tadolph case
58
employee_hire_evaluation
select name, location, district from shop order by count(*
select Name, Location, District from shop order by count(*
59
singer
select name from singer where net worth_millions > 1</s>
select Name from singer where net worth_millions > 1</s>
60
tvshow
select count(*), director from cartoon</s>
select count(*), Directed_by from cartoon</s>
61
world_1
select sum(surface_area) from country where countrycode = '
select sum(SurfaceArea) from country where countrycode = '
62
flight_2
select t1.airline from flights as t1 join destinations as
select t1.Airline from flights as t1 join destinations as
63
world_1
select avg(life_attendancy) from country where language
select avg(LifeExpectancy) from country where language
64
tvshow
select tv_series_name from series where episode = "
select series_name from series where episode = "
65
course_teach
select t1.name, count(*) from course as t1 jo
select t1.Name, count(*) from course as t1 jo
66
student_transcripts_tracking
select dept_name, dept_id from degrees</s>
select department_name, student_id from degrees</s>
67
world_1
select countrycode from country where language = 'english' or language =
select CountryCode from country where language = 'english' or language =
68
cre_Doc_Template_Mgt
select distinct t1.document_description from templates as t1
select distinct t1.Document_Description from Templates as t1
69
wta_1
select t1.first_name, t1.last_name, t1.
select t1.first_name, t1.last_name, t1.
70
student_transcripts_tracking
select distinct t1.section_name from sections as t1
select distinct t1.section_name from Sections as t1
71
cre_Doc_Template_Mgt
select count(distinct document_name) from documents</s>
select count(Document_Name) from documents</s>
72
network_1
select grade from high_schooler where grade >= 4</s>
select grade from high_schooler where grade >= 4</s>
73
network_1
select grade from high_schooler</s>
select grade from high_schooler</s>
74
car_1
select maker, full_name, count(*) from cars</s>
select Maker, FullName, count(*) from cars</s>
75
car_1
select model from cars group by model order by count(*
select Model from cars group by Model order by count(*
76
cre_Doc_Template_Mgt
select document_id, document_id, document_description
select document_id, document_id, document_description
77
pets_1
select t1.fname from pets as t1 join has_pet as
select t1.Fname from Pets as t1 join has_pet as
78
pets_1
select max(weight), pet_type from pets</s>
select max(weight), pet_age from pets</s>
79
dog_kennels
select charge_type, charge_amount from charges</s>
select charge_type, charge_amount from charges</s>
80
voter_1
select t1.contestant_name from contestants as t1 join
select t1.contestant_name from contestants as t1 join
81
network_1
select min(grade) from student where student_id not in (
select min(grade) from student where student_id not in (
82
flight_2
select t1.airline from airports as t1 join flights as t
select t1.Airline from airports as t1 join flights as t
83
tvshow
select t1.series_name from cartoon as t1 join directed_
select t1.series_name from Cartoon as t1 join directed_
84
tvshow
select max(share), min(share) from tv_series g
select max(Share), min(Share) from tv_series g
85
car_1
select avg(weight) from cars</s>
select avg(Weight) from cars</s>
86
concert_singer
select t1.name, t1.theme, count(*) from
select t1.Name, t1.Theme, count(*) from
87
poker_player
select t1.name from poker_players as t1 join people as
select t1.Name from poker_player as t1 join people as
88
world_1
select count(*) from city where language = 'english'</s>
select count(*) from city where language = 'english'</s>
89
tvshow
select t1.id from tv_series as t1 join cartoon
select t1.id from TV_series as t1 join cartoon
90
student_transcripts_tracking
select t1.first_name from students as t1 join students
select t1.first_name from Students as t1 join Students
91
wta_1
select count(*) from wta group by lname</s>
select count(*) from wta group by lname</s>
92
tvshow
select count(*) from cartoon where written_by = "jo
select count(*) from cartoon where written_by = "jo
93
flight_2
select airport_name from airports where airport_code not in (sel
select AirportName from airports where airport_code not in (sel
94
network_1
select t1.name from high_schoolers as t1 join likes
select t1.name from Highschooler as t1 join likes
95
concert_singer
select name from singer where age > (select avg(
select Name from singer where age > (select avg(
96
dog_kennels
select treatment_type_description from treatments group by treatment_
select treatment_type_description from treatments group by treatment_
97
cre_Doc_Template_Mgt
select distinct template_type_code from templates</s>
select Template_Type_Code from templates</s>
98
world_1
select name from country order by population desc limit 3</s>
select name from country order by population desc limit 3</s>
99
student_transcripts_tracking
select date_first_registered, date_first_registered
select date_first_registered, date_first_registered
100
concert_singer
select name, country, age from singer where age <unk>(
select Name, Country, Age from singer where Age <unk>(
101
world_1
select continent from city where capital = "anguilla"</s>
select Continent from city where capital = "anguilla"</s>
102
student_transcripts_tracking
select distinct address_id from students</s>
select address_id from students</s>
103
car_1
select sum(hitch) from models where horsepower = 3</s>
select sum(Weight) from models where horsepower = 3</s>
104
pets_1
select count(distinct pet_type) from pets</s>
select count(pet_age) from pets</s>
105
flight_2
select t1.airline from airlines as t1 join flights as t2
select t1.Airline from Airlines as t1 join flights as t2
106
dog_kennels
select treatment_type_description from treatments group by treatment_
select treatment_type_description from treatments group by treatment_
107
network_1
select t1.name from student as t1 join student as t2 on
select t1.name from Friend as t1 join Friend as t2 on
108
flight_2
select city, country from airports where city = "alt
select City, Country from airports where City = "alt
109
cre_Doc_Template_Mgt
select template_type_code from templates where template_type_code
select Template_Type_Code from templates where Template_Type_Code
110
world_1
select name, surface_area from country order by count(*)
select name, SurfaceArea from country order by count(*)
111
pets_1
select count(*) from pets group by stuid</s>
select count(*) from pets group by stuid</s>
112
course_teach
select t1.name from course as t1 join teacher as t2 on
select t1.Name from course as t1 join teacher as t2 on
113
flight_2
select t1.airline from flights as t1 join flights as
select t1.Airline from flights as t1 join flights as
114
dog_kennels
select breed_name from dogs order by count(*) desc li
select breed_name from dogs order by count(*) desc li
115
world_1
select count(*) from country where capital = 'africa'</s>
select count(*) from country where capital = 'africa'</s>
116
wta_1
select t1.winner_name from tournaments as t1 join winners
select t1.winner_name from rankings as t1 join winners
117
student_transcripts_tracking
select phone_number from students where first_name = "tim
select cell_mobile_number from students where first_name = "tim
118
course_teach
select t1.name from teacher as t1 join teacher as t2 on
select t1.Name from teacher as t1 join teacher as t2 on
119
world_1
select name from country order by count(*) desc limit 1
select name from country order by count(*) desc limit 1
120
tvshow
select count(distinct series_name), content from tv_channel
select count(series_name), Content from tv_channel
121
network_1
select t1.student_id, t1.friend_number from student
select t1.student_id, t1.friend_id from student
122
student_transcripts_tracking
select t1.course_name from students as t1 join students as t
select t1.course_name from Students as t1 join Students as t
123
concert_singer
select count(*) from concert where year = 2014 or year = 2015
select count(*) from concert where year = 2014 or year = 2015
124
dog_kennels
select owner_id, zip_code from dogs order by sum
select owner_id, zip_code from dogs order by sum
125
poker_player
select t1.name from poker_players as t1 join people as
select t1.Name from poker_player as t1 join people as
126
student_transcripts_tracking
select date_first_registered, date_left from students</s>
select date_first_registered, date_left from students</s>
127
student_transcripts_tracking
select count(*) from students</s>
select count(*) from students</s>
128
tvshow
select episode from tv_series where episode = "sky radio"
select Episode from tv_series where Episode = "sky radio"
129
world_1
select sum(population), max(gnp) from city wher
select sum(Population), max(Region) from city wher
130
cre_Doc_Template_Mgt
select document_id from documents where document_name >= 2</s>
select Document_ID from documents where document_name >= 2</s>
131
car_1
select distinct model from cars where weight > 3500 and maker
select Model from cars where weight > 3500 and maker
132
car_1
select count(*) from cars where year = 1980</s>
select count(*) from cars where year = 1980</s>
133
orchestra
select t1.name from conductor as t1 join performance as t2
select t1.Name from conductor as t1 join performance as t2
134
tvshow
select content from tv_series where channel = 's
select Content from tv_series where channel = 's
135
flight_2
select count(*) from flights where destination_abbrevi
select count(*) from flights where destination_abbrevi
136
cre_Doc_Template_Mgt
select document_name, template_id from documents where document
select Document_Name, Template_ID from documents where document
137
voter_1
select distinct distinct distinct distinct
select distinct distinct distinct distinct
138
museum_visit
select name from museum where museum_id not in (select museum
select Name from museum where museum_id not in (select museum
139
concert_singer
select name, nation from singer where song_name like '
select Name, Location from singer where song_Name like '
140
cre_Doc_Template_Mgt
select t1.document_id from templates as t1 join documents as
select t1.Document_ID from Templates as t1 join documents as
141
poker_player
select money_rank from poker_player order by height desc li
select Money_Rank from poker_player order by height desc li
142
network_1
select count(*) from high_schooler where grade = 9 or
select count(*) from high_schooler where grade = 9 or
143
cre_Doc_Template_Mgt
select version_number, template_type_code from templates where
select Version_Number, Template_Type_Code from templates where
144
car_1
select distinct model from cars where weight <unk>(select
select Model from cars where weight <unk>(select
145
dog_kennels
select professional_id, role_code, date_of_treatment
select professional_id, role_code, date_of_treatment
146
cre_Doc_Template_Mgt
select document_id, document_name from documents group b
select Document_ID, Document_Name from documents group b
147
flight_2
select city from airports order by source_accounty limit
select City from airports order by source_accounty limit
148
world_1
select name from country where population = "europe" and population > 80000
select name from country where population = "europe" and population > 80000
149
car_1
select maker from car_mades where full_name > 3</s>
select Maker from car_mades where full_name > 3</s>
150
car_1
select continent, count(*) from cars</s>
select Continent, count(*) from cars</s>
151
tvshow
select language, count(*) from tv_channel group by
select Language, count(*) from tv_channel group by
152
wta_1
select avg(t1.winner_rank) from matches as t
select avg(t1.winner_rank) from matches as t
153
cre_Doc_Template_Mgt
select template_type_code from templates where template_type_code
select Template_Type_Code from templates where Template_Type_Code
154
world_1
select name from country where capital = "50"</s>
select name from country where capital = "50"</s>
155
flight_2
select airport_name from airports where airport_code = 'a
select AirportName from airports where airport_code = 'a
156
student_transcripts_tracking
select first_name, middle_name, last_name from students w
select first_name, middle_name, last_name from students w
157
singer
select t1.title, t2.name from singer as t1 join
select t1.Title, t2.Name from singer as t1 join
158
student_transcripts_tracking
select avg(t1.t1.first_name) from students as
select avg(t1.t1.first_name) from Students as
159
car_1
select t1.weight from cars as t1 join cars as
select t1.Weight from cars_data as t1 join cars_data as
160
flight_2
select count(*) from airports</s>
select count(*) from airports</s>
161
employee_hire_evaluation

In [ ]:
# results['Preds_ec'] = preds_ec
# results.to_csv(os.path.join(GOOGLE_DRIVE_PATH,'anmol_predictions/Results_ec.csv'))

In [ ]:
# !pip install -q -U datasets > /dev/null
# # !pip install transformers
# !pip install --no-cache-dir transformers sentencepiece
# !pip3 install sqlparse nltk

# from transformers import AutoModelWithLMHead, AutoTokenizer
# from datasets import load_dataset
# import random, warnings
# import nltk
# warnings.filterwarnings("ignore")

In [ ]:
# valid_dataset = load_dataset('spider', split='validation')

['number', ' abc', 'ncv', 'xyz', ' grade']

In [ ]:
# i = 100
# print(valid_dataset[i]['db_id'])
# print(valid_dataset[i]['question'])
# print(valid_dataset[i]['query'])

['number', ' abc', ' t.ncv', ' a1.xyz', ' grade']